const exp =[
  {
    誰が: 'わたし',
    誰に: 'プログラム',
    内容: {
      isError: true,
      ログ: 'Null Pointer Exception',
      何が問題: '配列の添字が配列のサイズを超えていた'
    }
  },{
    誰が: '教師',
    誰に: 'わたし',
    何をした: '給食を食べられるまで昼休みは無しという指導をされた',
    意図: '理解不能' 
  },{
    誰が: '親',
    誰に: 'わたし',
    何をした: '35度を超える猛暑日にエアコンをつけさせてくれなかった',
    意図: '理解不能' 
  },{
    誰が: 'わたし',
    誰に: 'プログラム',
    内容: {
      isError: true,
      ログ: 'Segmentation Fault',
      何が問題: ' < を使うべき条件式に =< を使っていた'
    }
  },{
    誰が: '教員',
    誰に: '友達のA君',
    何をした: '電磁気学の単位を落とした',
    意図: 'レポートの提出が遅延したから'
  },{
    誰が: 'B党',
    誰に: '',
    何をした: '消費税増税に関する公約違反',
    意図: '',
  },{
    誰が: '教員',
    誰に: '後輩のD君',
    何をした: 'データ構造とアルゴリズムの単位を落とした',
    意図: 'レポートの提出が遅延したから'
  },{
    誰が: '教員',
    誰に: 'インターネット上の知り合いCさん',
    何をした: '電磁気の単位を落とした',
    意図: 'レポートの提出が遅延したから',
  },{
    誰が: 'A党',
    誰に: '',
    何をした: '資金繰りをめぐる不祥事',
    意図: '',
  }
]

module.exports = exp